HotelBooking/Common/Web References/Sabre.Hotels.Search/OTA_HotelAvailLLS2.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:sws_xsd="http://webservices.sabre.com/sabreXML/2011/10" xmlns:sws="https://webservices.sabre.com/websvc" targetNamespace="https://webservices.sabre.com/websvc" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema>
      <xsd:import schemaLocation="OTA_HotelAvailLLS2.2.1RQRS.xsd" namespace="http://webservices.sabre.com/sabreXML/2011/10" />
      <xsd:import schemaLocation="msg-header-2_0.xsd" namespace="http://www.ebxml.org/namespaces/messageHeader" />
      <xsd:import schemaLocation="wsse.xsd" namespace="http://schemas.xmlsoap.org/ws/2002/12/secext" />
      <xsd:import schemaLocation="STL_For_SabreProtocol_v.1.2.0.xsd" namespace="http://services.sabre.com/STL/v01" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="OTA_HotelAvailInput">
    <wsdl:part name="header" element="eb:MessageHeader" />
    <wsdl:part name="header2" element="wsse:Security" />
    <wsdl:part name="body" element="sws_xsd:OTA_HotelAvailRQ" />
  </wsdl:message>
  <wsdl:message name="OTA_HotelAvailOutput">
    <wsdl:part name="header" element="eb:MessageHeader" />
    <wsdl:part name="header2" element="wsse:Security" />
    <wsdl:part name="body" element="sws_xsd:OTA_HotelAvailRS" />
  </wsdl:message>
  <wsdl:portType name="OTA_HotelAvailPortType">
    <wsdl:operation name="OTA_HotelAvailRQ">
      <wsdl:input message="sws:OTA_HotelAvailInput" />
      <wsdl:output message="sws:OTA_HotelAvailOutput" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="OTA_HotelAvailSoapBinding" type="sws:OTA_HotelAvailPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="OTA_HotelAvailRQ">
      <soap:operation soapAction="OTA_HotelAvailLLSRQ" />
      <wsdl:input>
        <soap:header message="sws:OTA_HotelAvailInput" part="header" use="literal" />
        <soap:header message="sws:OTA_HotelAvailInput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </wsdl:input>
      <wsdl:output>
        <soap:header message="sws:OTA_HotelAvailOutput" part="header" use="literal" />
        <soap:header message="sws:OTA_HotelAvailOutput" part="header2" use="literal" />
        <soap:body use="literal" parts="body" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="OTA_HotelAvailService">
    <wsdl:port name="OTA_HotelAvailPortType" binding="sws:OTA_HotelAvailSoapBinding">
      <soap:address location="https://webservices.sabre.com/websvc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>