a.xml

<?xml version='1.0' encoding='UTF-8'?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header>
        <eb:MessageHeader xmlns:eb="http://www.ebxml.org/namespaces/messageHeader" SOAP-ENV:mustUnderstand="0">
            <eb:From>
                <eb:PartyId eb:type="urn:x12.org:IO5:01">from</eb:PartyId>
            </eb:From>
            <eb:To>
                <eb:PartyId eb:type="urn:x12.org:IO5:01">ws</eb:PartyId>
            </eb:To>
            <eb:CPAId>YOURPCC</eb:CPAId>
            <eb:ConversationId>YourConversationId</eb:ConversationId>
            <eb:Service eb:type="sabreXML"></eb:Service>
            <eb:Action>OTA_HotelAvailLLSRQ</eb:Action>
        </eb:MessageHeader> <eb:Security xmlns:ns6="http://schemas.xmlsoap.org/ws/2002/12/secext" SOAP-ENV:mustUnderstand="0">
            <eb:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/CERTG!ICESMSLB\/CRT.LB!-3488060046525942493!102430!0</eb:BinarySecurityToken>
        </eb:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <eb:OTA_HotelAvailRQ xmlns:eb="http://webservices.sabre.com/sabreXML/2003/07" TimeStamp="2011-01-26T12:30:00-06:00" Version="1.10.1">
            <eb:POS>
                <eb:Source PseudoCityCode="YOURPCC" /></eb:POS>
            <eb:AvailRequestSegments>
                <eb:AvailRequestSegment>
                    <eb:StayDateRange Start="11-10" End="11-15" />
                    <eb:RoomStayCandidates>
                        <eb:RoomStayCandidate>
                            <eb:GuestCounts>
                                <eb:GuestCount Count="1" /></eb:GuestCounts>
                        </eb:RoomStayCandidate>
                    </eb:RoomStayCandidates>
                    <eb:HotelSearchCriteria xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="eb:HotelSearchCriteria_type0">
                        <eb:Criterion>
                            <eb:HotelRef HotelCityCode="DFW" /></eb:Criterion>
                    </eb:HotelSearchCriteria>
                </eb:AvailRequestSegment>
            </eb:AvailRequestSegments>
        </eb:OTA_HotelAvailRQ>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>